[LanguageDefinition]

LanguageID = English

Title = "Редактор миров Digital Wizard's Lab v"

B_AddLayer = "Добавить слой"

I_Pivot = "Точка"
I_Circle = "Круг"
I_Rectangle = "Прямоугольник"
I_Ray = "Луч"
I_TopLeftTriangle = "Верхний-левый треугольник"
I_TopRightTriangle = "Верхний-правый треугольник"
I_BottomLeftTriangle = "Нижний-левый треугольник"
I_BottomRightTriangle = "Нижний-правый треугольник"
I_Raster = "Растр"
I_Null = "Нет"

L_X = "X:"
L_Y = "Y:"
L_Width = "Ширина:"
L_Height = "Высота:"
L_Shape = "Форма:"
L_Velocity = "Скорость:"
L_Angle = "Угол:"
L_DisplayingAngle = "Угол отобр.:"
L_CollLayer = "Слой cт.:"
L_DX = "DX:"
L_DY = "DY:"
L_Red = "Красный:"
L_Green = "Зеленый:"
L_Blue = "Синий:"
L_Alpha = "Прозрачн:"
L_XScale = "XМасшт:"
L_YScale = "YМасшт:"
L_VisDX = "ВизуалDX:"
L_VisDY = "ВизуалDY:"
L_Frame = "Кадр:"
B_SelectImage = "Выбрать изобр."
CB_Rotation = "Поворот"
CB_Scaling = "Масштаб"
CB_Physics = "Физика"
L_ImageAngle = "Угол изобр:"

M_File = "Файл"
M_New = "Новый проект"
M_Open = "Открыть проект..."
M_Save = "Сохранить проект..."
M_SaveAs = "Сохранить проект как..."
M_Merge = "Объединить проект с..."
M_Exit = "Выход"
M_Edit = "Правка"
M_SnapToGrid = "Прилипать к сетке"
M_GridSettings = "Настройки сетки"
M_BackgroundColor = "Выбрать цвет фона"
M_TileMapEditingMode = "Режим редактирования тайловой карты"
M_ReplacementOfTiles = "Автозамена тайлов"
M_ProlongTiles = "Продолжать тайлы"
M_CameraProperties = "Настройки камеры"
M_Incbin = "Автоматически создавать файл с incbin'ами"

M_View = "Вид"
M_ShowCollisions = "Показать формы столкновений"
M_ShowVectors = "Показать векторы"
M_ShowNames = "Показать названия"
M_ShowGrid = "Показать сетку"
M_BilinearFiltering = "Билинейная фильтрация изображений"

M_StartSimulation = "Запустить симуляцию"
N_SetBounds = "Для запуска необходимо задать границы слоя"
W_Simulation = "Физическая симуляция слоя"

M_Language = "Язык"
M_English = "Английский"
M_Russian = "Русский"

M_Help = "Справка"
M_HotKeys = "Список горячих клавиш"
M_About = "О программе"

M_SelectViewLayer = "Выбрать для отображения"
M_SelectContainer = "Выбрать для добавления спрайтов"
M_AddLayer = "Добавить слой"
M_AddTilemap = "Добавить тайловую карту"
M_AddSpriteMap = "Добавить карту спрайтов"
M_Import = "Импорт"
M_ImportTilemap = "Импортировать тайловую карту"
M_ImportTilemaps = "Импортировать тайловые карты"
M_EditBounds = "Редактировать границы"
M_RemoveBounds = "Убрать границы"
M_MixContent = "Смешивать содержимое"
M_EditTilemap = "Редактировать"
M_SelectTilemap = "Выбрать как спрайт"
M_ToggleVisibility = "Переключить видимость (V)"
M_ToggleActivity = "Переключить активность (A)"
M_Cut = "Вырезать"
M_Copy = "Копировать"
M_Paste = "Вставить"
M_ResizeTileMap = "Изменить размеры"
M_SelectTileset = "Выбрать набор тайлов"
M_EditTileCollisionShapes = "Редактировать коллизионные формы тайлов"
M_EditTileReplacementRules = "Редактировать правила автозамены тайлов"
M_Enframe = "Обрамить"
M_GenerateRules = "Сгенерировать правила"
M_Areas = "Для областей"
M_Walls = "Для стен"
M_TilemapProperties = "Свойства карты тайлов"
M_SetBounds = "Установить как границу текущего слоя"
M_Duplicate = "Дублировать"
M_Rename = "Переименовать"
M_SetClass = "Задать класс"
M_ShiftToTheTop = "На задний план (Home)"
M_ShiftUp = "Сдвинуть назад (PgUp)"
M_ShiftDown = "Сдвинуть вперед (PgDn)"
M_ShiftToTheBottom = "На передний план (End)"
M_Remove = "Удалить"

M_SpriteMapProperties = "Свойства"
N_CannotInsertNonSpriteToSpriteMap = "Невозможно вставить не-спрайт в спрайтовую карту"

D_UnsavedWorld = "Ваш проект не был сохранен, хотите ли вы сохранить его?"
D_SelectFileNameToSave = "Выберите проект для сохранения..."
D_SelectFileNameToOpen = "Выберите проект для открытия..."
D_SelectFileNameToMerge = "Выберите проект для объединения..."

D_EnterNameOfObject = "Введите название объекта:"
D_EnterClassNameOfObject = "Введите название класса объекта:"
D_EnterNameOfLayer = "Введите название нового слоя:"
D_EnterNameOfTilemap = "Введите название новой тайловой карты:"
D_EnterNameOfTileset = "Введите название нового набора тайлов:"
D_EnterNameOfSpriteMap = "Введите название новой карты спрайтов:"

W_SelectTileSet = "Выберите набор тайлов для тайловой карты"
D_SelectTilemapFile = "Выберите изображение-тайловую карту для обработки..."
N_CannotLoadImage = "Невозможно загрузить изображение."
N_TilemapSize = "Размеры изображения-тайловой карты должны делиться на размеры тайла."
D_SelectTilemapsDirectory = "Выберите директорию с файлами-изображениями тайловых карт..."
D_SelectFileToSaveImageTo = "Выберите файл изображения, в который будет сохранен тайлсет..."

B_OK = "OK"
B_Cancel = "Отмена"

W_ChooseTileSize = "Выберите размер тайла"
L_WidthInPixels = "Ширина в пикселях:"
L_HeightInPixels = "Высота в пикселях:"

W_SpriteMapProperties = "Свойства карты спрайтов"
D_EnterCellSize = "Введите размер ячейки:"
L_HorizontalCells = "Кол-во ячеек по горизонтали:"
L_VerticalCells = "Кол-во ячеек по вертикали:"
L_LeftMargin = "Левый отступ:"
L_TopMargin = "Верхний отступ:"
L_RightMargin = "Правый отступ:"
L_BottomMargin = "Нижний отступ:"
L_InitialArraysSize = "Начальный размер массивов-списков клеток:"
L_Sorted = "Отсортирована по Y-координате"
L_PivotMode = "Точечный режим"
N_CellSizeMoreThanZero = "Размеры ячеек должны быть больше 0"
N_ArraySizeMoreThanZero = "Размер массива должен быть больше 0"

W_ChooseTilemapSize = "Выберите размер тайловой карты"
L_WidthInTiles = "Ширина в тайлах:"
L_HeightInTiles = "Высота в тайлах:"

N_ParametersMustBeMoreThanZero = "Параметры должны быть больше 0"

W_CameraProperties = "Свойства камеры"
L_Isometric = "Изометрическая:"
L_X1 = "X1:"
L_Y1 = "Y1:"
L_X2 = "X2:"
L_Y2 = "Y2:"
N_VectorsAreParallel = "Векторы не должны быть параллельными"

W_TilesetRulesEditor = "Редактор правил автозаполнения тайлов"
L_SelectTileset = "Сначала выберите набор тайлов для тайловой карты"
L_SelectImage = "Сначала выберите изображение для набора тайлов"
B_AddCategory = "Добавить категорию"
M_RenameCategory = "Переименовать"
M_CopyCategory = "Копировать"
M_RemoveCategory = "Удалить"
M_AddTileRule = "Добавить правило"
M_RemoveTileRule = "Удалить"
M_ShiftTileRuleUp = "Сдвинуть вверх (PgUp)"
M_ShiftTileRuleDown = "Сдвинуть вниз (PgDown)"
L_XDivider = "XДелитель:"
L_YDivider = "YДелитель:"
D_EnterNameOfNewCategory = "Введите название новой категории:"
D_EnterTileShift = "Введите смещение тайлов:"
D_EnterNameOfCategory = "Введите название категории:"

W_ImageProperties = "Свойства изображения"
B_ReloadImage = "Перезагрузить изображение"
L_HorizontalCells = "Кол-во ячеек по горизонтали:"
L_VerticalCells = "Кол-во ячеек по вертикали:"
L_LeftBorder = "Левый бордюр"
L_TopBorder = "Верхний бордюр"
L_RightBorder = "Правый бордюр"
L_BottomBorder = "Нижний бордюр"
D_SelectImage = "Выберите изображение..."
N_ImageDivideable = "Размеры изображения должны делиться на количество клеток"
N_TileCellsQuantityMoreThanZero = "Количество клеток с тайлами должно быть больше 0"

W_SelectSpriteImage = "Выбeрите изображение для спрайта"
W_SelectTilesetImage = "Выбeрите изображение для набора тайлов"
W_SelectTilemapTileset = "Выбeрите набор тайлов для тайловой карты"
L_Image = "Изображение:"
L_Tileset = "Набор тайлов:"
B_Add = "Добавить"
B_AddImage = "Добавить изобр."
B_AddFrame = "Добавить рамку"
B_RenameTileset = "Переименовать"
B_Modify = "Изменить"
B_Remove = "Удалить"
D_TilemapDataLoss = "Некоторые данные тайловой карты могут быть утрачены, вы уверены, что хотите продолжить?"
D_TilesetDataLoss = "Некоторые данные набора тайлов могут быть утрачены, вы уверены, что хотите продолжить?"
D_TilemapsDataLoss = "Некоторые данные тайловых карт с этим набором тайлов могут быть утрачены, вы уверены, что хотите продолжить?"
D_ImageInUse = "Это изображение используется другими объектами, вы действительно хотите его удалить?"
D_TilesetInUse = "Этот набор тайлов используется тайловой картой или картами, вы действительно хотите его удалить?"
N_LessThanZero = "Некоторые размеры бордюров равны 0 или меньше."
N_BordersAreTooLarge = "Бордюры не оставляют место для центральной зоны."
L_Proportional = "Пропорциональная отрисовка краев"

W_GridSettings = "Настройки сетки"
L_PositionSnapping = "Режим прилипания передвижения:"
L_ResizingSnapping = "Режим прилипания изменения размеров:"
I_EdgeSnap = "Прилипать краями"
I_CenterSnap = "Прилипать центром"
I_FixedMovement = "Фиксированный шаг перемещения"
I_SizeSnap = "Прилипать размером"
I_FixedResize = "Фиксированный шаг изм. размеров"
L_CellWidth = "Ширина клетки:"
L_CellHeight = "Высота клетки:"
L_VerticalCellDivision = "Вертикальное разделение клеток:"
L_HorizontalCellDivision = "Горизонтальное разделение клеток:"
L_GridActive = "Прилипать к сетке"
B_SelectColor = "Выбрать цвет"
W_EnterAlpha = "Выберите значение прозрачности"
N_CellDivisionsMore = "Разделения клеток должны быть больше 0"
N_CellSizesMore = "Размеры клеток должны быть больше 0"

W_ResizeTilemap = "Изменение размера тайловой карты"
L_HorizontalShift = "Горизонтальный сдвиг:"
L_VerticalShift = "Вертикальный сдвиг:"
L_BlueTileMap = "Синий прямоугольник - текущий размер тайловой карты"
L_RedTileMap = "Красный прямоугольник - новый размер тайловой карты"

W_TileCollisionShapesEditor = "Редактор коллизионных форм тайлов"
L_CollisionLayer = "Слой cтолкновений:"
B_Close = "Закрыть"

D_AreYouSure = "Вы уверены, что хотите очистить карту?"

W_TileMapProperties = "Свойства тайловой карты"
L_HorizontalOrder = "Прорисовка столбцов"
L_VerticalOrder = "Прорисовка строк"
L_Wrapped = "Зацикленная"
I_LeftToRight = "Cлева направо"
I_RightToLeft = "Справа налево"
I_TopToBottom = "Сверху вниз"
I_BottomToTop = "Снизу вверх"

H_HotKeys = "Главное окно:|Стрелки, Ctrl - перемещаться по полю|Num+, Num- - изменить масштаб|D - дублировать объекты|H - скорректировать высоту спрайтов в зависимости от размера изображения и ширины|S - направить спрайты на курсор|N - задать имя выделенных спрайтов|T - задать класс выделенных спрайтов|A - переключить активность объектов|V - переключить видимость объектов|F - отразить спрайт горизонтально|Home - переместить объекты на задний план|PgUp - переместить объекты к заднему плану|PgDown - переместить объекты к переднему плану|End - переместить объекты на передний план|Del - удалить объекты||Окно набора тайлов:|F - заполнить карту тайлов тайлом под курсором|E - выбрать пустой тайл|Num0 - установить размер блока для выбраннойго тайла"
H_About1 = "Редактор миров фреймворка Digital Wizard's Lab||Версия "
H_About2 = "||http://code.google.com/p/dwlab"

M_ModifyParameter = "Изменить"
M_RemoveParameter = "Удалить"
L_ParameterName = "Имя:"
L_ParameterValue = "Значение:"
W_ParameterProerties = "Свойства параметра"

N_AddNewLayer = "Добавить слой"
N_AddNewParameter = "(Добавить параметр)"

W_LayerBounds = "Границы слоя"
B_ClearButton = "Удалить"